<?php

namespace Database\Seeders;

use App\Models\AttributeGroup;
use App\Models\AttributeValue;
use App\Models\ProductAttribute;
use App\Models\ProductCharacteristic;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class ProductCharacteristicSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $product_characteristics = [
            1 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 12, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Вьетнам'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'Intel Core i3-10105F'],
                    [ 'attribute' => 'Сокет ', 'value' => 'LGA 1200'],
                    [ 'attribute' => 'Код производителя', 'value' => '[CM8070104291323-SRH8V]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2020],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Производитель', 'value' => 'Intel'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'Intel Core i3'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'нет'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'Intel 9-e поколение'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Общее количество ядер', 'value' => 4],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 4],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 8],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 1, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 6, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => '14 нм'],
                    [ 'attribute' => 'Ядро', 'value' => 'Intel Comet Lake-S'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 3.7, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 4.4, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'нет'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR4'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 128, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 2],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR4-2666'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'нет'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 65, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 65, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 100, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'нет'],
                ],
                
                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 3.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '16 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                    [ 'attribute' => 'Особенности, дополнительно', 'value' => 'поддержка Intel Optane'],
                ],

            ],
            2 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 36, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Вьетнам'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'Intel Pentium Gold G6400'],
                    [ 'attribute' => 'Сокет ', 'value' => 'LGA 1200'],
                    [ 'attribute' => 'Код производителя', 'value' => '[BX80701G6400]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2020],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'есть'],
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нанесен на основание радиатора'],
                    [ 'attribute' => 'Производитель', 'value' => 'Intel'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'Intel Pentium'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'нет'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'Intel 11-e поколение'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Общее количество ядер', 'value' => 2],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 2],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 4],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 0.5, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 4, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => '14 нм'],
                    [ 'attribute' => 'Ядро', 'value' => 'Intel Comet Lake-S'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 4, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 'нет'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'нет'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR4'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 128, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 2],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR4-2666'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'нет'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 58, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 58, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 100, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'есть'],
                    [ 'attribute' => 'Модель графического процессора', 'value' => 'Intel UHD Graphics 610'],
                    [ 'attribute' => 'Максимальная частота графического ядра', 'value' => 1050, 'unit_type' => 'МГц'],
                    [ 'attribute' => 'Исполнительные блоки', 'value' => 12],
                    [ 'attribute' => 'Потоковые процессоры (Shading Units)', 'value' => 96],
                ],

                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 3.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '16 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                    [ 'attribute' => 'Особенности, дополнительно', 'value' => 'поддержка Intel Optane'],
                ],

            ],
            3 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 36, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Малайзия'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'AMD FX-4300'],
                    [ 'attribute' => 'Сокет ', 'value' => 'AM3+'],
                    [ 'attribute' => 'Код производителя', 'value' => '[FD4300WMW4MHK]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2012],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'есть'],
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нанесен на основание радиатора'],
                    [ 'attribute' => 'Производитель', 'value' => 'AMD'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'AMD FX'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'нет'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'AMD FX'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Общее количество ядер', 'value' => 4],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 4],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 4],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 4, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 4, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => '32 нм'],
                    [ 'attribute' => 'Ядро', 'value' => 'AMD Vishera'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 3.8, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 4, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'есть'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR3'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 128, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 2],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR3-1866'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'нет'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 95, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 95, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 70.5, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'нет'],
                ],
                
                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'нет'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => 'нет'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                ],
                
            ],
            4 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 12, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Малайзия'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'AMD Ryzen 5 3600'],
                    [ 'attribute' => 'Сокет ', 'value' => 'AM4'],
                    [ 'attribute' => 'Код производителя', 'value' => '[100-000000031]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2019],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Производитель', 'value' => 'AMD'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'AMD Ryzen 5'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'да'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'AMD Ryzen 3000'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Общее количество ядер', 'value' => 6],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 6],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 12],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 3, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 32, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => 'TSMC 7FF'],
                    [ 'attribute' => 'Ядро', 'value' => 'AMD Matisse'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 3.6, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 4.2, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'есть'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR4'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 128, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 2],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR4-3200'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'есть'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 65, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 65, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 95, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'нет'],
                ],
                
                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 4.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '20 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                ],
                
            ],
            5 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 12, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Вьетнам'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'Intel Pentium Gold G5400'],
                    [ 'attribute' => 'Сокет ', 'value' => 'LGA 1151-v2'],
                    [ 'attribute' => 'Код производителя', 'value' => '[CM8068403360112]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2018],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Производитель', 'value' => 'Intel'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'Intel Pentium'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'нет'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'Intel 8-e поколение'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Общее количество ядер', 'value' => 2],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 2],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 4],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 0.5, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 4, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => '14 hm'],
                    [ 'attribute' => 'Ядро', 'value' => 'Intel Coffee Lake S'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 3.7, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 'нет'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'нет'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR4'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 64, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 2],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR4-2400'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'есть'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 58, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 58, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 100, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'есть'],
                    [ 'attribute' => 'Модель графического процессора ', 'value' => 'Intel UHD Graphics 610'],
                    [ 'attribute' => 'Максимальная частота графического ядра', 'value' => 1050, 'unit_type' => 'МГц'],
                    [ 'attribute' => 'Исполнительные блоки', 'value' => 12],
                    [ 'attribute' => 'Потоковые процессоры (Shading Units)', 'value' => 96],
                ],

                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 3.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '16 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                    [ 'attribute' => 'Особенности, дополнительно', 'value' => 'поддержка Intel Optane'],
                ],

            ],
            6 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 12, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Вьетнам'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'Intel Core i7-13790F'],
                    [ 'attribute' => 'Сокет ', 'value' => 'LGA 1700'],
                    [ 'attribute' => 'Код производителя', 'value' => '[BXC8071513790F]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2023],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Производитель', 'value' => 'Intel'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'Intel Core i7'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'да'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'Intel 13-e поколение'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Общее количество ядер', 'value' => 16],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 8],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 8],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 24],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 24, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 33, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => 'Intel 7'],
                    [ 'attribute' => 'Ядро', 'value' => 'Intel Raptor Lake-S'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 2.1, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 5.2, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 1.5, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 4.1, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'нет'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR5'],
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR4'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 128, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 2],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR4-3200'],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR5-5600'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'нет'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 219, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 65, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 100, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'нет'],
                ],

                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 5.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '20 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                    [ 'attribute' => 'Особенности, дополнительно', 'value' => 'технология Intel GNA'],
                ],

            ],
            7 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 12, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Малайзия'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'AMD Ryzen 9 7950X'],
                    [ 'attribute' => 'Сокет ', 'value' => 'AM5'],
                    [ 'attribute' => 'Код производителя', 'value' => '[100-000000514]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2022],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Производитель', 'value' => 'AMD'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'AMD Ryzen 9'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'да'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'AMD Ryzen 7000'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Общее количество ядер', 'value' => 16],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 16],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 32],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 16, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 64, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => 'TSMC 5nm FinFET'],
                    [ 'attribute' => 'Ядро', 'value' => 'AMD Raphael'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 4.5, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 5.7, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'есть'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR5'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 128, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 2],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR5-5200'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'есть'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 170, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 170, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 95, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'есть'],
                    [ 'attribute' => 'Модель графического процессора', 'value' => 'AMD Radeon Graphics'],
                    [ 'attribute' => 'Максимальная частота графического ядра', 'value' => 2200, 'unit_type' => 'МГц'],
                ],

                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 5.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '24 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                    [ 'attribute' => 'Особенности, дополнительно', 'value' => 'поддержка AMD EXPO'],
                ],

            ],
            8 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 12, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Китай'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'AMD Ryzen 9 7900X'],
                    [ 'attribute' => 'Сокет ', 'value' => 'AM5'],
                    [ 'attribute' => 'Код производителя', 'value' => '[100-100000589WOF]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2022],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Производитель', 'value' => 'AMD'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'AMD Ryzen 7'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'да'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'AMD Ryzen 6000'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Общее количество ядер', 'value' => 12],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 12],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 24],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 12, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 64, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => 'TSMC 5nm FinFET'],
                    [ 'attribute' => 'Ядро', 'value' => 'AMD Raphael'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 4.7, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 5.6, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'есть'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR5'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 128, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 2],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR5-5200'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'есть'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 170, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 170, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 95, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'есть'],
                    [ 'attribute' => 'Модель графического процессора', 'value' => 'AMD Radeon Graphics'],
                    [ 'attribute' => 'Максимальная частота графического ядра', 'value' => 2200, 'unit_type' => 'МГц'],
                    [ 'attribute' => 'Исполнительные блоки', 'value' => 2],
                    [ 'attribute' => 'Потоковые процессоры (Shading Units)', 'value' => 128],
                ],

                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 5.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '24 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                    [ 'attribute' => 'Особенности, дополнительно', 'value' => 'поддержка AMD EXPO'],
                ],

            ],
            9 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 12, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Малайзия'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'Intel Core i9-10920X'],
                    [ 'attribute' => 'Сокет ', 'value' => 'LGA 2066'],
                    [ 'attribute' => 'Код производителя', 'value' => '[CD8069504382000-SRGSJ]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2019],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Производитель', 'value' => 'Intel'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'Intel Core i9'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'нет'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'Intel 10-e поколение'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Общее количество ядер', 'value' => 12],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 12],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 24],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 12, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 19.25, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => '14 нм'],
                    [ 'attribute' => 'Ядро', 'value' => 'Intel Cascade Lake-X'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 3.5, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 4.8, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'есть'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR4'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 256, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 4],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR4-2933'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'нет'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 165, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 165, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 94, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'нет'],
                ],
                
                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 3.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '48 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                    [ 'attribute' => 'Особенности, дополнительно', 'value' => 'поддержка Intel Optane'],
                ],

            ],
            10 => [
                'Заводские данные' => [
                    [ 'attribute' => 'Гарантия продавца', 'value' => 12, 'unit_type' => 'мес.'],
                    [ 'attribute' => 'Страна-производитель', 'value' => 'Китай'],
                ],

                'Общие параметры' => [
                    [ 'attribute' => 'Модель', 'value' => 'AMD Ryzen Threadripper PRO 5995WX'],
                    [ 'attribute' => 'Сокет ', 'value' => 'sWRX8'],
                    [ 'attribute' => 'Код производителя', 'value' => '[100-000000444]'],
                    [ 'attribute' => 'Год релиза', 'value' => 2022],
                    [ 'attribute' => 'Система охлаждения в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Термоинтерфейс в комплекте', 'value' => 'нет'],
                    [ 'attribute' => 'Производитель', 'value' => 'AMD'],
                    [ 'attribute' => 'Семейство процессоров', 'value' => 'AMD Ryzen Threadripper'],
                    [ 'attribute' => 'Для игрового компьютера', 'value' => 'нет'],
                    [ 'attribute' => 'Поколение процессоров', 'value' => 'AMD Ryzen Threadripper PRO 5000'],
                ],

                'Ядро и архитектура' => [
                    [ 'attribute' => 'Общее количество ядер', 'value' => 64],
                    [ 'attribute' => 'Количество производительных ядер ', 'value' => 64],
                    [ 'attribute' => 'Количество энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Максимальное число потоков', 'value' => 128],
                    [ 'attribute' => 'Объем кэша L2', 'value' => 32, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Объем кэша L3', 'value' => 256, 'unit_type' => 'МБ'],
                    [ 'attribute' => 'Техпроцесс', 'value' => 'TSMC 7FF'],
                    [ 'attribute' => 'Ядро', 'value' => 'AMD Castle Peak'],
                ],

                'Частота и возможность разгона' => [
                    [ 'attribute' => 'Базовая частота процессора', 'value' => 2.7, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Максимальная частота в турбо режиме', 'value' => 4.5, 'unit_type' => 'ГГц'],
                    [ 'attribute' => 'Базовая частота энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Частота в турбо режиме энергоэффективных ядер', 'value' => 'нет'],
                    [ 'attribute' => 'Свободный множитель', 'value' => 'есть'],
                ],

                'Параметры оперативной памяти' => [
                    [ 'attribute' => 'Тип памяти', 'value' => 'DDR4'],
                    [ 'attribute' => 'Максимально поддерживаемый объем памяти', 'value' => 2048, 'unit_type' => 'ГБ'],
                    [ 'attribute' => 'Количество каналов', 'value' => 8],
                    [ 'attribute' => 'Частота оперативной памяти', 'value' => 'DDR4-3200'],
                    [ 'attribute' => 'Поддержка режима ECC', 'value' => 'есть'],
                ],

                'Тепловые характеристики' => [
                    [ 'attribute' => 'Тепловыделение (TDP)', 'value' => 280, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Базовое тепловыделение', 'value' => 280, 'unit_type' => 'Вт'],
                    [ 'attribute' => 'Максимальная температура процессора', 'value' => 95, 'unit_type' => '°C'],
                ],

                'Графическое ядро' => [
                    [ 'attribute' => 'Интегрированное графическое ядро', 'value' => 'нет'],
                ],
                
                'Шина и контроллеры' => [
                    [ 'attribute' => 'Встроенный контроллер PCI Express', 'value' => 'PCI-E 4.0'],
                    [ 'attribute' => 'Число линий PCI Express', 'value' => '128 шт'],
                ],

                'Дополнительно' => [
                    [ 'attribute' => 'Технология виртуализации', 'value' => 'есть'],
                    [ 'attribute' => 'Особенности, дополнительно', 'value' => 'крепление для системы охлаждения в комплекте'],
                ],

            ],

        ];

        foreach ($product_characteristics as $product_id => $attributeGroups) {
            foreach ($attributeGroups as $group => $attributes) {
                // Проверка на существование AttributeGroup и добавление, если не существует
                $attributeGroup = AttributeGroup::firstOrCreate(['name' => $group]);
        
                foreach ($attributes as $attribute) {
                    // Проверка на существование атрибута и его значения в ProductAttribute и AttributeValue
                    $productAttribute = ProductAttribute::firstOrCreate([
                        'name' => $attribute['attribute'],
                        'group_id' => $attributeGroup->id
                    ]);
        
                    // Определение типа значения
                    if (is_numeric($attribute['value'])) {
                        // Если значение числовое
                        $valueInt = $attribute['value'];
                        // Проверяем, есть ли единица измерения
                        $unitType = isset($attribute['unit_type']) ? $attribute['unit_type'] : null;
        
                        // Создаем запись в AttributeValue
                        $attributeValue = AttributeValue::firstOrCreate([
                            'attribute_id' => $productAttribute->id,
                            'value_int' => $valueInt,
                            'unit_type' => $unitType
                        ]);
                    } else {
                        // Если значение строковое
                        $valueString = $attribute['value'];
                        // Создаем запись в AttributeValue
                        $attributeValue = AttributeValue::firstOrCreate([
                            'attribute_id' => $productAttribute->id,
                            'value_string' => $valueString
                        ]);
                    }
        
                    // Создание записи в ProductCharacteristic
                    ProductCharacteristic::create([
                        'product_id' => $product_id,
                        'attribute_id' => $productAttribute->id,
                        'value_id' => $attributeValue->id
                    ]);
                }
            }
        }

        // foreach ($product_characteristics as $product_id => $attributeGroups) {
        //     foreach ($attributeGroups as $group => $attributes) {
        //         // Проверка на существование AttributeGroup и добавление, если не существует
        //         $attributeGroup = AttributeGroup::firstOrCreate(['name' => $group]);
                
                
        //         foreach ($attributes as $attribute) {
        //             // Проверка на существование атрибута и его значения в ProductAttribute и AttributeValue
        //             $productAttribute = ProductAttribute::firstOrCreate([
        //                 'name' => $attribute['attribute'],
        //                 'group_id' => $attributeGroup->id
        //             ]);
                    

        //             $attributeValue = AttributeValue::firstOrCreate([
        //                 'attribute_id' => $productAttribute->id,
        //                 'name' => $attribute['value']
        //             ]);

        //             // Создание записи в ProductCharacteristic
        //             ProductCharacteristic::create([
        //                 'product_id' => $product_id,
        //                 'attribute_id' => $productAttribute->id,
        //                 'value_id' => $attributeValue->id
        //             ]);
        //         }
        //     }
        // }
    }
}
